In [3]:
#import libraries 

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [4]:
import mysql.connector
from mysql.connector import Error

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

# Put your MySQL server details
host = "localhost"
user = "Oracle"
password = "Oluwatobi@4994"


# Create a connection
connection = create_server_connection(host, user, password)

MySQL Database connection successful

In [5]:
#Creating mysql_python database 

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database create successfully")
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "create database mysql_python"

create_database( connection, create_database_query)

Error: '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [11]:
#connect to database 

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None 
    try: 
        connection = mysql.connector.connect(
            host = host_name, 
            user = user_name, 
            password = user_password,
            database = db_name)
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [7]:
#execute sql queries 

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error: '{err}'")

In [17]:
create_orders_table = """ 
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_name VARCHAR(30) NOT NULL,
    product_name VARCHAR(30) NOT NULL,
    date_ordered DATE,
    quantity INT,
    unit_price FLOAT, 
    phone_number VARCHAR(20))
"""

#connecting to database 

connection = create_db_connection("localhost","Oracle",password,"mysql_python") 
execute_query(connection, create_orders_table)

MySQL Database connection successful
Query was successful

In [18]:
#insert data 

Data_orders = """
INSERT INTO orders (order_id, customer_name, product_name, date_ordered, quantity, unit_price, phone_number)
VALUES
    (201, 'Chinedu', 'Smartphone', '2023-01-15', 1, 50000.00, '08012345678'),
    (202, 'Blessing', 'Laptop', '2023-03-20', 1, 80000.00, '08023456789'),
    (203, 'Chinyere', 'Tablet', '2023-05-10', 2, 30000.00, '08034567890'),
    (204, 'Emeka', 'Smartwatch', '2023-07-05', 1, 25000.00, '08045678901'),
    (205, 'Aisha', 'Smart Speaker', '2023-09-12', 1, 15000.00, '08056789012'),
    (206, 'Abdullahi', 'Earphones', '2023-11-18', 1, 5000.00, '08067890123'),
    (207, 'Ifeoma', 'Bluetooth Headset', '2023-12-24', 1, 7000.00, '08078901234'),
    (208, 'Chukwudi', 'External Hard Drive', '2024-02-08', 1, 12000.00, '08089012345'),
    (209, 'Adeola', 'Wireless Mouse', '2024-04-14', 1, 3000.00, '08090123456'),
    (210, 'Tolu', 'Smart TV', '2024-06-20', 1, 60000.00, '08001234567'),
    (211, 'Chiamaka', 'Fitness Tracker', '2024-08-25', 1, 18000.00, '08012345678'),
    (212, 'Chidinma', 'Gaming Console', '2024-10-30', 1, 40000.00, '08023456789'),
    (213, 'Damilola', 'Digital Camera', '2024-12-05', 1, 25000.00, '08034567890');
"""
connection = create_db_connection("localhost","Oracle",password,"mysql_python") 
execute_query(connection, Data_orders)

MySQL Database connection successful
Query was successful

In [19]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
       cursor.execute(query)
       result = cursor.fetchall()
       return result
    except Error as err:
        print(f"Error: '{err}'")

In [23]:
#using the select statement 

q7 = """ 
select * from orders order by unit_price desc;
"""
connection = create_db_connection("localhost","Oracle",password,"mysql_python")
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL Database connection successful
(202, 'Blessing', 'Laptop', datetime.date(2023, 3, 20), 1, 80000.0, '08023456789')
(210, 'Tolu', 'Smart TV', datetime.date(2024, 6, 20), 1, 60000.0, '08001234567')
(201, 'Chinedu', 'Smartphone', datetime.date(2023, 1, 15), 1, 50000.0, '08012345678')
(212, 'Chidinma', 'Gaming Console', datetime.date(2024, 10, 30), 1, 40000.0, '08023456789')
(203, 'Chinyere', 'Tablet', datetime.date(2023, 5, 10), 2, 30000.0, '08034567890')
(204, 'Emeka', 'Smartwatch', datetime.date(2023, 7, 5), 1, 25000.0, '08045678901')
(213, 'Damilola', 'Digital Camera', datetime.date(2024, 12, 5), 1, 25000.0, '08034567890')
(211, 'Chiamaka', 'Fitness Tracker', datetime.date(2024, 8, 25), 1, 18000.0, '08012345678')
(205, 'Aisha', 'Smart Speaker', datetime.date(2023, 9, 12), 1, 15000.0, '08056789012')
(208, 'Chukwudi', 'External Hard Drive', datetime.date(2024, 2, 8), 1, 12000.0, '08089012345')
(207, 'Ifeoma', 'Bluetooth Headset', datetime.date(2023, 12, 24), 1, 7000.0, '08078901234')
(206, 'Abdullahi', 'Earphones', datetime.date(2023, 11, 18), 1, 5000.0, '08067890123')
(209, 'Adeola', 'Wireless Mouse', datetime.date(2024, 4, 14), 1, 3000.0, '08090123456')

In [24]:
#create dataframe 

from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity", "unit_price", "phone_number"]

df = pd.DataFrame(from_db, columns = columns)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,202,Blessing,Laptop,2023-03-20,1,80000.0,08023456789
1,210,Tolu,Smart TV,2024-06-20,1,60000.0,08001234567
2,201,Chinedu,Smartphone,2023-01-15,1,50000.0,08012345678
3,212,Chidinma,Gaming Console,2024-10-30,1,40000.0,08023456789
4,203,Chinyere,Tablet,2023-05-10,2,30000.0,08034567890
5,204,Emeka,Smartwatch,2023-07-05,1,25000.0,08045678901
6,213,Damilola,Digital Camera,2024-12-05,1,25000.0,08034567890
7,211,Chiamaka,Fitness Tracker,2024-08-25,1,18000.0,08012345678
8,205,Aisha,Smart Speaker,2023-09-12,1,15000.0,08056789012
9,208,Chukwudi,External Hard Drive,2024-02-08,1,12000.0,08089012345
10,207,Ifeoma,Bluetooth Headset,2023-12-24,1,7000.0,08078901234
11,206,Abdullahi,Earphones,2023-11-18,1,5000.0,08067890123
12,209,Adeola,Wireless Mouse,2024-04-14,1,3000.0,08090123456

In [25]:
#update command 

update = """
update orders 
set unit_price = 8000
where order_id = 207
"""
connection = create_db_connection("localhost","Oracle",password,"mysql_python") 
execute_query(connection, update)

MySQL Database connection successful
Query was successful

In [26]:
q8 = """ 
select * from orders where order_id = 207 desc;
"""
connection = create_db_connection("localhost","Oracle",password,"mysql_python")
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL Database connection successful
(207, 'Ifeoma', 'Bluetooth Headset', datetime.date(2023, 12, 24), 1, 8000.0, '08078901234')

In [32]:
#delete command 

delete_order = """
delete from orders 
where order_id = 202;
"""
connection = create_db_connection("localhost","Oracle",password,"mysql_python") 
execute_query(connection, delete_order)

MySQL Database connection successful
Query was successful

In [33]:
q10 = """ 
select * from orders;
"""
connection = create_db_connection("localhost","Oracle",password,"mysql_python")
results = read_query(connection, q10)
for result in results:
    print(result)

MySQL Database connection successful
(201, 'Chinedu', 'Smartphone', datetime.date(2023, 1, 15), 1, 50000.0, '08012345678')
(203, 'Chinyere', 'Tablet', datetime.date(2023, 5, 10), 2, 30000.0, '08034567890')
(204, 'Emeka', 'Smartwatch', datetime.date(2023, 7, 5), 1, 25000.0, '08045678901')
(205, 'Aisha', 'Smart Speaker', datetime.date(2023, 9, 12), 1, 15000.0, '08056789012')
(206, 'Abdullahi', 'Earphones', datetime.date(2023, 11, 18), 1, 5000.0, '08067890123')
(207, 'Ifeoma', 'Bluetooth Headset', datetime.date(2023, 12, 24), 1, 8000.0, '08078901234')
(208, 'Chukwudi', 'External Hard Drive', datetime.date(2024, 2, 8), 1, 12000.0, '08089012345')
(209, 'Adeola', 'Wireless Mouse', datetime.date(2024, 4, 14), 1, 3000.0, '08090123456')
(210, 'Tolu', 'Smart TV', datetime.date(2024, 6, 20), 1, 60000.0, '08001234567')
(211, 'Chiamaka', 'Fitness Tracker', datetime.date(2024, 8, 25), 1, 18000.0, '08012345678')
(212, 'Chidinma', 'Gaming Console', datetime.date(2024, 10, 30), 1, 40000.0, '08023456789')
(213, 'Damilola', 'Digital Camera', datetime.date(2024, 12, 5), 1, 25000.0, '08034567890')

In [ ]:
C:\Users\HP PC\Desktop\DATA CLASS\mysql_python script.ipynb